Revit 2024 API
BuiltInFailures.SteelElementFailures.SteelElementModifyRangesTaskNotFinished Property
 Cannot modify ranges while background calculations are in progress.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SteelElementModifyRangesTaskNotFinished { get; }
Visual Basic
Public Shared ReadOnly Property SteelElementModifyRangesTaskNotFinished As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SteelElementModifyRangesTaskNotFinished {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace